Tekla Open API Reference for Tekla Structures 2025
ConnectiveGeometry.GetConnection Method
 Returns 2 connecting line segments between geometrySection1 and geometrySection2 sections, if sections are connected, otherwise returns empty list.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public IList<LineSegment> GetConnection(
	GeometrySection geometrySection1,
	GeometrySection geometrySection2
)
Public Function GetConnection (
	geometrySection1 As GeometrySection,
	geometrySection2 As GeometrySection
) As IList(Of LineSegment)
Parameters
geometrySection1
Type: Tekla.Structures.Model.GeometrySection
The first GeometrySection.
geometrySection2
Type: Tekla.Structures.Model.GeometrySection
The second GeometrySection.
Return Value
Type: IList<LineSegment>
2 connecting line segments if sections are connected, otherwise returns empty list.
See Also
Reference
ConnectiveGeometry Class
Tekla.Structures.Model Namespace